<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"b5d88ccd7b9059e2a126f93960da72b97dad3ab19dede0763d75e5da865ee496","plan_job_ref":"Job Create terraform plan #5 at https://github.com/Emeric-hub/infra-experiments/actions/runs/5223974389","plan_hash":"0cb1b2c9e77051cd1ef682b97eab317f6c777acce99eb566fea1203cb267a001","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __LOCAL-Proxmox/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.ubuntu-terraform will be created
  + resource "proxmox_vm_qemu" "ubuntu-terraform" {
      + additional_wait           = 5
      + automatic_reboot          = true
      + balloon                   = 256
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + clone_wait                = 10
      + cores                     = 1
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "cpu,memory,network,disk,usb"
      + id                        = (known after apply)
      + iso                       = "local:iso/Ubuntu_Server_22.04.2.iso"
      + kvm                       = true
      + memory                    = 1024
      + name                      = "ubuntu-terraform"
      + nameserver                = (known after apply)
      + numa                      = true
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "ubuntu"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "lsi"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + tags                      = "terraform"
      + target_node               = "proxmox"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "20G"
          + slot               = (known after apply)
          + ssd                = 1
          + storage            = "local-lvm"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = true
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "e1000"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #5](https://github.com/Emeric-hub/infra-experiments/actions/runs/5223974389)